src/business/VerbruikServicePortType.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}. -->
<definitions targetNamespace="http://business/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://business/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://business/" schemaLocation="VerbruikServicePortType_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="berekenVerbruik">
    <part name="parameters" element="tns:berekenVerbruik"/>
  </message>
  <message name="berekenVerbruikResponse">
    <part name="parameters" element="tns:berekenVerbruikResponse"/>
  </message>
  <portType name="VerbruikService">
    <operation name="berekenVerbruik">
      <input ns1:Action="http://business/VerbruikService/berekenVerbruikRequest" message="tns:berekenVerbruik" xmlns:ns1="http://www.w3.org/2007/05/addressing/metadata"/>
      <output ns2:Action="http://business/VerbruikService/berekenVerbruikResponse" message="tns:berekenVerbruikResponse" xmlns:ns2="http://www.w3.org/2007/05/addressing/metadata"/>
    </operation>
  </portType>
</definitions>

